Ran Plan for 2 projects:

1. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
---

### 2. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
!       available_maintenance_versions = [
!           "POSTGRES_15_12.R20250302.00_04" -> "POSTGRES_15_12.R20250302.00_12",
        ]
        id                             = "backstage-prod"
!       maintenance_version            = "POSTGRES_15_10.R20250112.01_03" -> "POSTGRES_15_12.R20250302.00_04"
        name                           = "backstage-prod"
        # (17 unchanged attributes hidden)

!       settings {
!           version                      = 145 -> 201
            # (16 unchanged attributes hidden)

            # (6 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_secret_manager_secret.backstage-bits-credentials["backstage-soundcheck-http-collector-token"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "backstage"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "backstage-soundcheck-http-collector-token"
+       terraform_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.ksa-access["backstage-soundcheck-http-collector-token"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "backstage-soundcheck-http-collector-token"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fprod%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```